app/controllers/comment_controller.rb

  def index
    @comments = Comment.find(:all, :conditions => "parent_id is NULL", :order => 'created_at DESC')
---
SELECT * FROM "comments" WHERE (twitter_handle = 'lizzyleehunter' and parent_id is NULL) ORDER BY created_at DESC LIMIT 1

  def show
    @comment = Comment.find(params[:id])
---
SELECT * FROM "comments" WHERE (twitter_handle = 'lizzyleehunter' and parent_id is NULL) ORDER BY created_at DESC LIMIT 1

  def create
    unless params[:content].blank?
      u = User.find_by_id(session[:user])
      c = Comment.new
      c.title = params[:title]
      c.content = params[:content]
      c.parent_id = params[:parent]
      c.user = u
      c.save
---
SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
INSERT INTO "comments" ("created_at", "title", "updated_at", "twitter_response_to", "uid", "user_id", "parent_id", "content", "twitter_handle", "source") VALUES('2010-10-11 06:31:37', NULL, '2010-10-11 06:31:37', NULL, NULL, 1, 1, 'This is a test.', NULL, NULL)