app/controllers/user_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show
    @user = User.find_by_id(params[:id])

INSERT INTO "users" ("salt", "name", "created_at", "crypted_password", "updated_at", "url", "twitter_handle", "email") VALUES('xNZSsSG0Qn', 'Dean Hudson', '2010-10-11 06:09:11', 'cc9031a3a89755cb87a8c848e1fc35f2e5b80fdd', '2010-10-11 06:09:11', NULL, 'deanero', 'dean@ero.com')
---
  def signup
    @user   = User.new
    if request.post?
      @user.update_attributes(params[:user])
      if @user.save